/*C. Капризный король
Ограничение времени	1 секунда
Ограничение памяти	64 Мб
Шахматный король стоит в левом верхнем углу шахматной доски размером N×M. За один шаг он может перейти в соседнюю клетку ниже, либо в клетку правее, либо в клетку правее и ниже (то есть сделать шаг по диагонали). Его цель — добраться таким образом до правого нижнего угла доски. Да только вот король тот капризен, а потому не наступает трижды подряд на клетки одного цвета. Доска имеет стандартную шахматную покраску: каждая клетка является либо чёрной, либо белой, а цвет каждой пары имеющих общую сторону клеток различен. Сколько существует различных путей, которыми капризный король смог бы добраться до своей цели? В ответ вывести число таких путей по модулю 1000 (иначе говоря - остаток от деления реального числа путей на 1000).

Формат ввода
Входные данные содержат два натуральных числа NN и MM, разделённые одним пробелом. Оба числа не превосходят 100.

Формат вывода
Вывести одно целое число — ответ на вопрос задачи.

Пример 1
Ввод	Вывод
2 2
3
Пример 2
Ввод	Вывод
2 3
5
Пример 3
Ввод	Вывод
3 3
12
*/